{"author_date": "2015-09-24 15:50:40+01:00", "msg": "Simplify Jackson-related auto-configuration for HATEOAS and Data REST\n\nThis commit simplifies the Jackson-related auto-configuration that’s\napplied when Spring HATEOAS and Spring Data REST are on the classpath.\n\nPreviously, Boot used Jackson2HalModule to apply the HAL-related\nObjectMapper configuration to the context’s primary ObjectMapper. This\nwas to allow HAL-formatted responses to be sent for requests accepted\napplication/json (see gh-2147). This had the unwanted side-effect of\npolluting the primary ObjectMapper with HAL-specific functionality.\nFurthermore, Jackson2HalModule is an internal of Spring HATEOAS that\n@olivergierke has asked us to avoid using.\n\nThis commit replaces the use of Jackson2HalModule with a new approach.\nNow, the message converters of any RequestMappingHandlerAdapter beans\nare examined and any TypeConstrainedMappingJackson2HttpMessageConverter\ninstances are modified to support application/json in addition to their\ndefault support for application/hal+json. This behaviour can be disabled\nby setting spring.hateoas.use-hal-as-default-json-media-type to false.\nThis property is named after Spring Data REST’s configuration option\nwhich has the same effect when using Spring Data REST. The new property\nreplaces the old spring.hateoas.apply-to-primary-object-mapper property.\n\nPreviously, when Spring Data REST was on the classpath,\nJacksonAutoConfiguration would be switched off resulting in the context\ncontaining multiple ObjectMappers, none of which was primary.\n\nThis commit configures RepositoryRestMvcAutoConfiguration to run after\nJacksonAutoConfiguration. This gives the latter a chance to create its\nprimary ObjectMapper before the former adds its ObjectMapper beans to\nthe context.\n\nPreviously, the actuator’s hypermedia support assumed that the\nHttpMessageConverters bean would contain every HttpMessageConverter\nbeing used by Spring MVC. When Spring HATEOAS is on the classpath this\nisn’t the case as it post-processes RequestMappingHandlerAdapter beans\nand adds a TypeConstrainedMappingJackson2HttpMessageConverter to them.\nThis wasn’t a problem in the past as the primary ObjectMapper, used by a\nvanilla MappingJackson2HttpMessageConverter, was configured with Spring\nHATEOAS’sJackson2HalModule. Now that this pollution has been tidied up\nthe assumption described above no longer holds true. MvcEndpointAdvice,\nwhich adds links to the actuator’s json responses, has been updated\nto look at the HttpMessageConverters of every\nRequestMappingHandlerAdapter when it’s trying to find a converter to\nuse to write a response with additional hypermedia links.\n\nIntegration tests have been added to spring-boot-actuator to ensure\nthat the changes described above have not regressed the ability to\nconfigure its json output using spring.jackson.* properties (see\ngh-1729).\n\nCloses gh-3891"}